[
 
  {
    "slug": "muhammad-rubeel-ali",
    "name": "Muhammad Rubeel Ali, 2015",
    "image": "/assets/img/wall/rubeel.jpg",
    "role": "Contract Manager <br> First Fix <br> Saudi Arabia",
    "summary": "Muhammad Rubeel Ali<br>BS Mechanical Technology. 2015<br>FACULTY OF ENGINEERING &amp; TECHNOLOGY<br><br>First Fix<br>Contract Manager<br>Saudi Arabia",
    "tags": ["Mechanical Engineering", "Contract Management", "Project Management", "Claim Management", "Team Leadership"],
    "stats": [
      {
        "value": "8",
        "label": "Team Members"
      },
      {
        "value": "3",
        "label": "Contract Types"
      },
      {
        "value": "9+",
        "label": "Years Experience"
      }
    ],
    "achievements": [
      "Won accolades for designing efficient cooling system at university tech fest",
      "Leads team of 8 professionals deployed across multiple projects",
      "Successfully handled complex claims: Acceleration, Escalation, Inflation, and Extension of Time (EOT)",
      "Successfully completed projects under challenging circumstances",
      "Brought delayed projects back on track without compromising quality",
      "Managed high-stakes contracts with stringent deadlines and budget constraints",
      "Earned client trust leading to future collaborations",
      "Expert in FIDIC, NEC, and JCT contract management"
    ],
    "story": [
      "Academic Achievements:<br>I graduated with a degree in Mechanical Technology, where I developed a strong foundation in engineering principles, problem-solving, and analytical thinking. My time at university was marked by a deep engagement with both theoretical concepts and practical applications. I was actively involved in several projects that bridged the gap between academic learning and real-world engineering challenges. One of my most memorable projects was designing an efficient cooling system for industrial applications, which won accolades at our university's annual tech fest.",
      "Professional Achievements:<br>Upon entering the professional world, I chose to specialize in Contract Management. This field intrigued me because it combines technical knowledge with legal and managerial expertise. Over the years, I have gained extensive experience in managing various types of contracts, including FIDIC, NEC, and JCT. I currently lead a team of eight talented individuals, each deployed across different projects. Our collective efforts have led to successful project completions, often under challenging circumstances.",
      "One of my notable professional achievements is in the realm of Claim Management. I have successfully handled complex claims related to Acceleration, Escalation, Inflation, and Extension of Time (EOT). These experiences have honed my skills in negotiation and dispute resolution, ensuring that all parties reach a fair and equitable agreement.",
      "Personal Achievements:<br>On a personal level, I take pride in my dedication to continuous learning and professional development. I regularly attend workshops and seminars to stay updated with the latest industry trends and advancements. This commitment not only enhances my own capabilities but also allows me to mentor and guide my team more effectively.",
      "Inspiring Stories:<br>One story that stands out is a project where we faced significant delays due to unforeseen circumstances. Through meticulous planning, strategic acceleration, and effective communication with stakeholders, we managed to bring the project back on track without compromising on quality. This experience taught me the value of resilience, teamwork, and proactive problem-solving.",
      "Another instance was during the early stages of my career when I had to manage a high-stakes contract with stringent deadlines and budget constraints. Despite the pressure, I led my team to successfully deliver the project, earning the client's trust and paving the way for future collaborations."
    ]
  },
  {
    "slug": "kashif-javed",
    "name": "Kashif Javed, 2006",
    "image": "/assets/img/wall/kashif-javed.jpg",
    "role": "Director Cloud Services <br> NetSol Technologies Inc. <br> Pakistan",
    "headline": "Leading cloud transformation and delivering secure, scalable IT solutions to global clients",
    "summary": "Kashif Javed<br>BS Computer Science. 2006<br>FACULTY OF COMPUTER SCIENCE<br><br>NetSol Technologies Inc.<br>Director Cloud Services<br>Pakistan",
    "tags": ["Computer Science", "Cloud Services", "IT Leadership", "DevOps"],
    "stats": [
      {
        "value": "50+",
        "label": "IT Projects"
      },
      {
        "value": "30%",
        "label": "Cost Reduction"
      },
      {
        "value": "60%",
        "label": "Efficiency Gain"
      }
    ],
    "achievements": [
      "Delivered over 50 successful IT projects",
      "Reduced cloud costs by 30%",
      "Improved DevOps efficiency by 60%",
      "Led technical teams in cloud architecture and project management"
    ],
    "quote": "It gave me a strong technical foundation, problem-solving skills, and confidence to tackle real-world challenges.",
    "quoteBy": "Kashif Javed",
    "story": [
      "At a time when emerging fields in technology were rapidly reshaping industries, The University of Lahore's (UOL) timely provision of quality education in computer science laid the groundwork for future leaders. Today, our graduates are thriving in competitive, fast-paced markets, creating impact, leading innovation, and shaping the digital future. Among them is Mr Kashif Javed, an accomplished IT professional whose career journey reflects both personal ambition and the strength of his academic foundation.",
      "Graduating with a Bachelor of Science in Computer Science in 2006, Mr Kashif's fascination with technology was evident from the start. \"I was always curious about how technology works and loved solving problems,\" he recalls. For him, computer science offered the perfect platform to turn passion into profession, providing the tools to build solutions that make a difference.",
      "Mr Kashif's first step into the professional world came as a software engineer at Cyber Craft Private Limited, where he worked on developing web applications. His consistent performance and leadership qualities soon opened doors to more senior roles. \"Over time, I moved into senior roles in project management and cloud architecture, gaining leadership experience,\" he shares.",
      "Today, he holds the position of Director Cloud Services at NetSol Technologies Inc., a prominent player in enterprise software and cloud solutions. In this role, Mr Kashif manages cloud projects, leads technical teams, and ensures the secure, scalable delivery of IT solutions to global clients. Among his notable accomplishments are delivering over 50 successful IT projects, cutting cloud costs by 30%, and improving DevOps efficiency by 60%.",
      "Looking back, Mr Kashif credits his university experience for giving him more than just technical skills. \"It gave me a strong technical foundation, problem-solving skills, and confidence to tackle real-world challenges,\" he says. He fondly recalls the software engineering courses and the mentorship of a supportive professor, which guided his interest in IT project leadership — a focus that continues to define his career.",
      "Like any professional journey, Mr Kashif's path hasn't been without obstacles. Managing tight deadlines and keeping up with emerging technologies posed significant challenges. His approach to overcoming these problems was based on continuous learning and teamwork. \"You can't afford to stop evolving in tech,\" he remarks.",
      "Beyond the office, Mr Kashif remains actively involved in the community. He mentors students, speaks at tech events, and supports training sessions to help the next generation find their footing in the industry. \"It's important to give back and help others grow in tech,\" he notes.",
      "For current students and fresh graduates stepping into the workforce, Mr Kashif advises them to \"learn consistently and don't be afraid to take on new challenges.\" He emphasises the importance of honing skills in cloud computing, project management, GenAI, and communication, calling them essential for modern tech roles.",
      "As for the future, Mr Kashif has his sights set on leading global cloud transformation programmes and mentoring future IT leaders, while exploring opportunities in advisory roles.",
      "Mr Kashif shared these reflections with the Press and Publications Cell (PPC) in April 2025 as part of our alumni spotlight series in collaboration with the Office of Alumni Relations."
    ]
  },
  {
    "slug": "ahmed-bilal-akhtar",
    "name": "Dr Ahmed Bilal Akhtar, 2015",
    "image": "/assets/img/wall/ahmed-bilal.png",
    "role": "Fellow in Hepatobiliary and Surgical Oncology Anaesthesia <br> McMaster University <br> Canada",
    "headline": "From UOL medical graduate to anaesthetist at McMaster University, overcoming challenges through clinical excellence and research",
    "summary": "Dr Ahmed Bilal Akhtar<br>MBBS. UCMD, UOL<br>FACULTY OF MEDICINE<br><br>McMaster University<br>Fellow in Hepatobiliary and Surgical Oncology Anaesthesia<br>Canada",
    "tags": ["Medicine", "Anaesthesia", "Research", "Fellowship"],
    "stats": [
      {
        "value": "10",
        "label": "Publications"
      },
      {
        "value": "5",
        "label": "Research Projects"
      },
      {
        "value": "3",
        "label": "Awards"
      }
    ],
    "achievements": [
      "Completed FCPS Part II in Anaesthesia (2022)",
      "Published 10 research papers",
      "Ahsan Rashid Gold Medal for best research (2020)",
      "Best Research Award at 3rd KEMCA UK Symposium",
      "Best Poster Award at 18th SKMCH Cancer Symposium",
      "Presented at Royal College of Anaesthetists (2023)",
      "Published in British Journal of Anaesthesia (BJA) Open"
    ],
    "quote": "Graduating from a relatively new institution led to unwarranted assumptions about my competence. I addressed these by consistently proving myself through clinical excellence, academic achievement, and international recognition.",
    "quoteBy": "Dr Ahmed Bilal Akhtar",
    "story": [
      "What does it take to move from a fresh medical graduate facing early doubts to an anaesthetist at McMaster University, Canada? Dr Ahmed Bilal Akhtar recounted his journey in conversation with the Press and Publications Cell (PPC) at The University of Lahore (UOL).",
      "He began by recalling his medical education at the University College of Medicine and Dentistry (UCMD), UOL, where he completed his MBBS. Speaking about his choice of field, he explained that he had always been drawn to medicine for its intellectual depth. He searched for a speciality that combined procedural skills with immediate clinical decision-making, and anaesthesia provided the balance he was looking for. After graduation, he completed his internship at Nawaz Sharif Social Security Hospital in Lahore and briefly worked as a Medical Officer in anaesthesia before advancing to Fellow of the College of Physicians and Surgeons (FCPS) Part I.",
      "Later on, he pursued structured residency training at Shaukat Khanum Memorial Cancer Hospital (SKMCH) and completed his FCPS Part II in 2022. During this time, he published ten research papers, presented at national forums, and received recognition for his academic contributions. After this, he joined King Faisal Specialist Hospital in Riyadh as an assistant consultant. In 2023, he passed the written examination for the Fellowship of the College of Anaesthesiologists (FCAI) (Ireland) and is now undertaking a fellowship in Hepatobiliary and Surgical Oncology Anaesthesia at McMaster University, Canada.",
      "At McMaster, he provides anaesthesia for complex hepatobiliary and surgical oncology procedures such as liver resections, Whipple's procedures, and Transjugular Intrahepatic Portosystemic Shunt (TIPS). Alongside his clinical work, he continues to engage in research, quality audits, and academic teaching. His contributions have been acknowledged through several awards, including the Ahsan Rashid Gold Medal for best research in 2020, the Best Research Award at the 3rd King Edward Medical College Alumni Association (KEMCA) UK Symposium, and the Best Poster Award at the 18th SKMCH Cancer Symposium. He has presented at international conferences, including the Royal College of Anaesthetists in 2023, and published in the British Journal of Anaesthesia (BJA) Open. At present, he has ten publications and five more research projects in progress.",
      "Reflecting on his aims, Dr Ahmed shared that he wishes to contribute to global anaesthesia practices while also strengthening the speciality in Pakistan through academic leadership. His goal is to secure international certification and work within patient-centred anaesthesia programmes.",
      "Looking back at his time at UOL, he credited the academic structure, clinical exposure, and experienced faculty for providing a strong foundation. He remarked, \"Graduating from a relatively new institution led to unwarranted assumptions about my competence. I addressed these by consistently proving myself through clinical excellence, academic achievement, and international recognition.\" He highlighted that the faculty members who taught subjects like Physiology, Pathology, Ophthalmology, and Obstetrics & Gynaecology played a central role in the development of his critical thinking and clinical reasoning.",
      "In his message to current students and graduates, he advised setting both short- and long-term goals and pursuing them with consistency. He stressed the importance of valuing effort and growth alongside outcomes, developing both personally and professionally, learning from mentors, and preparing for examinations with structured approaches."
    ]
  },
  {
    "slug": "mohsin-saleem",
    "name": "Mohsin Saleem, 2017",
    "image": "/assets/img/wall/mohsin-saleem.jpg",
    "role": "Manager of Operations <br> Robust MD <br> United States",
    "headline": "Chemistry alumnus shares how education at UOL laid the foundation for his global success in US healthcare",
    "summary": "Mohsin Saleem<br>Department of Chemistry<br>FACULTY OF SCIENCES<br><br>Robust MD<br>Manager of Operations<br>United States",
    "tags": ["Chemistry", "Healthcare Operations", "Leadership", "US Healthcare"],
    "stats": [
      {
        "value": "30%",
        "label": "Claim Reduction"
      },
      {
        "value": "2.5",
        "label": "Years to Manager"
      }
    ],
    "achievements": [
      "Led team that reduced claim rejections by over 30%",
      "Rapidly progressed from resource level to manager in 2.5 years",
      "Successfully scaled operations during critical growth phase",
      "Mentored trainees who rose to leadership positions"
    ],
    "quote": "Stay curious, be adaptable, and never stop learning. Build strong communication and problem-solving skills. And remember career success is a journey, not a sprint.",
    "quoteBy": "Mohsin Saleem",
    "story": [
      "Some journeys do not follow a straight line, and that is where their magic lies. For Mr Mohsin Saleem (Alumnus, Department of Chemistry), what began as a passion for chemical reactions and molecular structures at The University of Lahore (UOL) transformed into a flourishing leadership role in the dynamic world of US healthcare. His story, shared with the Press and Publications Cell (PPC), is not just one of career transition but of steadfastness, adaptability, and a desire to uplift others along the way.",
      "Mr Mohsin recalls being drawn to chemistry out of sheer curiosity. \"It answered my 'why' and 'how' questions,\" he reflected. UOL's strong academic structure, seasoned faculty, and advanced labs offered the ideal launchpad for his scientific mindset, preparing him with skills in analytical thinking, attention to detail, and problem-solving, all of which proved instrumental later in an entirely different industry.",
      "Shortly after graduation, Mr Mohsin ventured into the domain of medical billing. He started from the resource level and rapidly moved up the ranks. Within two years, his commitment earned him the title of team lead. In another six months, he was promoted to supervisor, and today, he serves as manager of operations in a leading healthcare services company, Robust MD. In this role, he manages cross-functional teams, ensures high-quality service delivery, and continues to break benchmarks in performance and efficiency.",
      "Among his notable professional milestones, Mr Mohsin led a team that reduced claim rejections by over 30% and played a key role in scaling operations during a critical growth phase. His passion for mentoring others has seen many of his trainees rise into leadership positions, an achievement he finds especially fulfilling.",
      "Despite the leap from chemistry to healthcare operations, Mr Mohsin credits his time at UOL for providing the transferable skills necessary for success. He speaks fondly of Ms Nimra Ehsaan (Lecturer, Department of Chemistry), whose mentorship went beyond the classroom. \"She continued to guide me even after graduation,\" he notes, highlighting the value of long-term academic support.",
      "Mr Mohsin's professional aspirations now turn towards entrepreneurship, as he plans to establish his own healthcare services business in the United States. Drawing on his extensive knowledge of medical billing and operational management, he aims to provide high-quality, efficient solutions to healthcare providers.",
      "Committed to giving back, Mr Mohsin remains actively engaged with his alma mater and the wider professional community. He has attended several international conferences on chemistry and leadership and regularly shares his insights with current students at UOL.",
      "His advice to students and recent graduates is rooted in realism and encouragement: \"Stay curious, be adaptable, and never stop learning. Build strong communication and problem-solving skills. And remember career success is a journey, not a sprint.\""
    ]
  },
  {
    "slug": "sara-sattar",
    "name": "Dr Sara Sattar, 2024",
    "image": "/assets/img/wall/sara.jpg",
    "role": "Head of Quality Assurance <br> Integrated Medical Care (IMC) Hospital <br>  Pakistan",
    "headline": "Pharmacy alumna successfully serves at the forefront of healthcare QA leadership",
    "summary": "Dr Sara Sattar<br>PhD Pharmacology<br>FACULTY OF PHARMACY<br><br>IMC Hospital<br>Head of Quality Assurance<br>Lahore, Pakistan",
    "tags": ["Pharmacy", "Quality Assurance", "Healthcare Leadership", "Patient Safety"],
    "stats": [
      {
        "value": "PhD",
        "label": "Pharmacology"
      },
      {
        "value": "IMC",
        "label": "Hospital QA"
      }
    ],
    "achievements": [
      "Head of QA at IMC Hospital, Lahore",
      "Develops and enforces QA policies aligned with global standards",
      "Leads clinical audits and champions patient safety",
      "Organises continuous training programmes",
      "Manages accreditation processes"
    ],
    "quote": "Hard work, resilience, and a good education are the only keys to a successful future.",
    "quoteBy": "Dr Sara Sattar",
    "story": [
      "Some dreams are so deeply rooted that they pass from one generation to the next, quietly guiding each decision until they bloom into reality. For Dr Sara Sattar, her path in pharmacology began as her father's dream and transformed into a journey marked by reinvention and remarkable leadership in healthcare quality. Today, she stands not only as a The University of Lahore (UOL) PhD graduate but also as the Head of Quality Assurance (QA) at Integrated Medical Care (IMC) Hospital, Lahore, impacting systems, standards, and lives. Recently, the Press and Publications Cell at UOL had the pleasure of unwinding her success journey.",
      "Dr Sara's academic trajectory—beginning with a Pharm-D, followed by MPhil and culminating in a PhD in Pharmacology from UOL—was shaped by personal commitment and strong mentorship. She recalls the instrumental support she received from her PhD supervisor, Dr Arham Shabbir (Associate Professor, Department of Pharmacy), whose expertise and student-first approach helped her navigate complex research work during a critical phase of her life.",
      "Her career began soon after her MPhil, when she was appointed QA Officer at the Punjab Healthcare Commission. She later transitioned to the Primary & Secondary Health Department as a Health Inspector. Then came a pivotal pause, a career break to focus on her family and her PhD research work at the University of Health Sciences (UHS). But far from being a setback, this intermission became a turning point. Re-entering the professional world, she took on the role of QA Manager at Omar Hospital & Cardiac Center and later rose to become the Head of QA at IMC Hospital.",
      "In her current leadership position, Dr Sara wears many hats. She develops and enforces QA policies aligned with global standards, leads clinical audits, champions patient safety, organises continuous training programmes, manages accreditation processes, and cultivates a culture of quality across departments. From reducing operational inefficiencies to advocating for patient-centred care, her work directly shapes the standard of care delivered to thousands.",
      "One of her greatest challenges, she admits, has been balancing a demanding healthcare leadership role while raising two children. But she meets it with determination, thoughtful time management, and clear boundaries between work and personal life. \"With planning, boundaries, and self-care, it is possible,\" she reflects.",
      "Dr Sara also gives back meaningfully to UOL and the community. Through her hospital leadership role, she forms educational linkages, mentors aspiring healthcare professionals, and initiates community-based improvements in health access and quality. \"By building bridges between the hospital, university, and community, we can leave an impact on healthcare quality and access for all,\" she stated.",
      "To today's students and recent graduates, her advice is simple but firm: \"Hard work, resilience, and a good education are the only keys to a successful future.\" She encourages them to embrace the evolving demands of healthcare by developing AI skills, which she believes are fast becoming indispensable.",
      "Dr Sara's story is one of promises kept, roles redefined, and excellence quietly pursued, a proof that when dreams are backed by education, ambition and vision, they can shape systems, empower communities, and inspire the next generation."
    ]
  },
  {
    "slug": "muhammad-irfan-maqsood",
    "name": "Dr Muhammad Irfan Maqsood, 2008",
    "image": "/assets/img/wall/Meet-Dr-Irfan.jpg",
    "role": "Founder of The IMAQ Network  <br> Canada",
    "headline": "Multi-award-winning researcher, author, and founder of a Canada-based international startup network",
    "summary": "Dr Muhammad Irfan Maqsood<br>MSc Molecular Biology and Biotechnology<br>INSTITUTE OF MOLECULAR BIOLOGY AND BIOTECHNOLOGY (IMBB)<br><br>The IMAQ Network<br>Founder & CEO<br>Canada",
    "tags": ["Molecular Biology", "Research", "Entrepreneurship", "Publishing"],
    "stats": [
      {
        "value": "30+",
        "label": "Publications"
      },
      {
        "value": "656",
        "label": "Citations"
      },
      {
        "value": "12",
        "label": "Books"
      },
      {
        "value": "10",
        "label": "H-index"
      }
    ],
    "achievements": [
      "Authored over 30 peer-reviewed research papers",
      "Published 12 books",
      "Techpreneur of the Year (2015–2016)",
      "Young Entrepreneur of Iran (2017)",
      "Distinguished Researcher of the Year (2016)",
      "Advisor to the President at Ferdowsi University of Mashhad",
      "Senior Lecturer at Azerbaijan Technical University"
    ],
    "quote": "Do not treat university as a degree factory, treat it as a launchpad. Engage meaningfully. Build relationships. Learn deeply.",
    "quoteBy": "Dr Muhammad Irfan Maqsood",
    "story": [
      "Driven by an early fascination with the human body's complexity, Dr Muhammad Irfan Maqsood (Alumnus, Institute of Molecular Biology and Biotechnology (IMBB), The University of Lahore (UOL)) has forged a global career at the intersection of science, innovation, and entrepreneurship. He earned his MSc degree in 2008. Today, he is the founder of The IMAQ Network (IMAQPRESS, IMAQ Technologies, and IMAQ Research), based in Canada, championing research, publishing, and educational innovation across continents.",
      "Dr Irfan's journey began with a strong academic foundation at UOL, where he developed a curiosity about the molecular mechanisms underlying life, health, and disease. Reflecting on his academic roots, he shared, \"The MSc programme transformed me from a student into a passionate researcher, educator, and author. It taught me how to ask questions that matter and pursue them relentlessly.\"",
      "Following graduation, his first role was as a Research Associate (Biology) at a Lahore-based tech firm. His academic excellence soon led him to secure a fully funded PhD scholarship in Cell and Molecular Biology through the Organization of Islamic Cooperation (OIC) scholarship programme. That opportunity became the launchpad for his international academic career, taking him to Iran, Türkiye, Azerbaijan, and eventually Canada.",
      "Over the years, he has authored over 30 peer-reviewed research papers (with 656 citations and an h-index of 10), delivered talks across Economic Cooperation Organization (ECO) countries, and published 12 books. His accolades include multiple honours such as Techpreneur of the Year (2015–2016), Young Entrepreneur of Iran (2017), and Distinguished Researcher of the Year (2016). He has held academic roles, including Advisor to the President at Ferdowsi University of Mashhad and Senior Lecturer at Azerbaijan Technical University.",
      "As founder of the IMAQ Network, he leads projects that bridge transdisciplinary research, science communication, academic publishing, and technology startups. Under his leadership, the network has supported emerging scientists globally through open-access platforms, mentorships, and collaborative initiatives.",
      "\"My mission now is to build a community of 100 bestselling authors,\" he noted. \"I want to uncover hidden talent, especially in Pakistan, and bring their voices to the global stage through our platforms.\"",
      "His journey has not been without challenges. Relocating across countries, adapting to new systems, and building credibility in foreign academic ecosystems required resilience. \"These transitions tested me,\" he recalled. \"But I adopted them as part of a life rooted in research and entrepreneurship. I even chronicled my failures in my book, 'I am a Failed Entrepreneur', now available globally.\"",
      "Balancing work and life, for him, is not a dichotomy. \"My personal and professional lives are intertwined,\" he explained. \"My wife is also a PhD in Cell and Molecular Biology and an early career researcher in Canada; together, we live and breathe science.\"",
      "To current students and graduates, his advice is bold: \"Do not treat university as a degree factory, treat it as a launchpad. Engage meaningfully. Build relationships. Learn deeply. And remember: it's not your grades but your ideas and connections that will define your success.\" He encourages students to prioritise skills such as writing, communication, editing, publishing, and global networking. \"Think internationally. Pitch your ideas. Manage your projects. Be a champion—or find one.\""
    ]
  },
  {
    "slug": "hafsa-farrukh",
    "name": "Hafsa Farrukh, 2018",
    "image": "/assets/img/wall/hafsa.jpg",
    "role": "CEO <br> Psynergy Lounge <br> Pakistan",
    "headline": "LSBS's alumna advances therapeutic care and psychological well-being with innovative practices",
    "summary": "Hafsa Farrukh<br>MS Clinical Psychology<br>Lahore School of Behavioural Sciences (LSBS)<br><br>Psynergy Lounge<br>CEO<br>Faisalabad, Pakistan",
    "tags": ["Clinical Psychology", "Mental Health", "Well-Being", "Education"],
    "stats": [
      {
        "value": "20",
        "label": "Years Experience"
      },
      {
        "value": "Gold",
        "label": "Medal Winner"
      }
    ],
    "achievements": [
      "Gold Medal for academic excellence in MS Clinical Psychology",
      "First clinical psychologist in Faisalabad to establish Well-Being Centre at National Textile University",
      "Pioneered well-being programme at Beaconhouse School Network",
      "Recognised as one of top practising clinical psychologists in Pakistan",
      "Currently pursuing PhD in Psychology at University of Utara Malaysia"
    ],
    "quote": "Commit wholeheartedly to learning, respect your mentors, and cultivate both soft and technical skills. With patience and dedication, success will follow.",
    "quoteBy": "Hafsa Farrukh",
    "story": [
      "In a country where mental health often takes a backseat, Ms Hafsa Farrukh, a distinguished alumna of The University of Lahore (UOL), is emerging as a trailblazer in clinical psychology. Her contributions to the field of clinical psychology have positioned her as a leading figure in mental health advocacy and care in Pakistan. The Press and Publications Cell (PPC) at The University of Lahore (UOL) was delighted to engage in a conversation with her and highlight her successful journey.",
      "Ms Hafsa earned her MS in Clinical Psychology from UOL with distinction, receiving a Gold Medal for her academic excellence. Her passion for understanding the human mind and her determination to support emotional well-being have driven a career that spans nearly two decades. Currently pursuing her PhD in Psychology at the University of Utara Malaysia, Ms Hafsa continues to expand her expertise and impact.",
      "Her time at UOL played a pivotal role in her development. The guidance of faculty members, along with hands-on placements and workshops, provided the foundation she needed to thrive in her career.",
      "Her professional journey began as a programme coordinator at the National Education Foundation. After relocating due to personal commitments, she re-entered the professional world with a renewed sense of purpose. Initially engaging in psychological testing and analysis, she later transitioned into training and mentorship. Her perseverance and continued learning eventually led her to full-time clinical practice.",
      "Today, she stands at the helm of Psynergy Lounge as its CEO, a comprehensive platform offering therapy, training, counselling, internships, and mentoring. Notably, she is the first clinical psychologist in Faisalabad to establish a Well-Being Centre at National Textile University. She also played a pioneering role in introducing a well-being programme at Beaconhouse School Network, which has now expanded across the country.",
      "Ms Hafsa's current endeavours include conducting psychological assessments, providing therapy, implementing treatment strategies, and leading professional training sessions in educational and corporate environments. She is also actively working with academic institutions to develop counselling centres that address student mental health needs.",
      "Recognised independently as one of the top practising clinical psychologists in Pakistan, she remains driven by a long-standing vision: to see mental health services integrated into every educational institution. After years of advocacy, she is finally witnessing this goal begin to take shape.",
      "Ms Hafsa also continues to contribute to the academic community by offering mentorship and career guidance to students, helping them navigate their paths with clarity and purpose.",
      "While talking to PPC, she reflected on the challenges she has faced—especially restarting her career after city relocations and working independently—Ms Hafsa credits her resilience and internal drive for her ability to overcome adversity and rebuild with strength.",
      "Looking ahead, she aspires to establish a state-of-the-art psychiatric hospital that provides holistic mental healthcare, uniting all essential services under one roof. Her message to current students and graduates is: commit wholeheartedly to learning, respect your mentors, and cultivate both soft and technical skills. With patience and dedication, success will follow."
    ]
  },
  {
    "slug": "mahwash-mukhtar",
    "name": "Dr Mahwash Mukhtar, 2015",
    "image": "/assets/img/wall/mahwish.jpg",
    "role": "Researcher and Educator in Pharmaceutical Technology <br> University of Szeged <br> Hungary",
    "headline": "Makes impactful pharmaceutical contributions through research and teaching",
    "summary": "Dr Mahwash Mukhtar<br>Pharm D, MPhil, PhD Pharmaceutical Technology<br>FACULTY OF PHARMACY<br><br>University of Szeged<br>Researcher & Educator<br>Hungary",
    "tags": ["Pharmacy", "Nanotechnology", "Research", "Drug Delivery"],
    "stats": [
      {
        "value": "PhD",
        "label": "2022"
      },
      {
        "value": "Multiple",
        "label": "Awards"
      }
    ],
    "achievements": [
      "Completed PhD in Pharmaceutical Technology at University of Szeged, Hungary (2022)",
      "Research focus on nanotechnology-based drug delivery systems",
      "Youngest chair of PharmConnect Industrial Congress",
      "Serves on editorial boards of high-ranked journals",
      "Recognition for highest cumulative impact factor during PhD",
      "Collaborates with laboratories across Spain, Croatia, Romania, and Bulgaria"
    ],
    "quote": "Pharmacy is a constantly evolving field, and success lies in lifelong learning, networking, and embracing diverse opportunities.",
    "quoteBy": "Dr Mahwash Mukhtar",
    "story": [
      "Dr Mahwash Mukhtar, A pharmacy graduate of The University of Lahore (UOL), has carved an exceptional path in pharmaceutical sciences, advancing research in drug delivery systems and inspiring future pharmacists. She recently shared her experience with the Press and Publications Cell (PPC) at UOL.",
      "After completing her Pharm D at UOL in 2015, she pursued an MPhil in Pharmaceutics from Quaid-i-Azam University, Islamabad, before moving to the University of Szeged, Hungary, for a fully funded PhD in Pharmaceutical Technology. Her doctoral work, completed in 2022, focused on nanotechnology-based drug delivery, with applications in pulmonary and oral administration. She also explored antimicrobial-resistant coatings for catheters, 3D-printed slides, and synthetic polymer derivatives designed for targeted therapy.",
      "Today, Dr Mahwash continues her research in nanotechnology and collaborates with laboratories across Spain, Croatia, Romania, and Bulgaria. Her academic contributions have earned recognition on international platforms, including the Aerosol Society's NRN Summer School in the UK. She has also been honoured with awards for her publications, including recognition for achieving the highest cumulative impact factor during her PhD. Significantly, she became the youngest chair of the PharmConnect Industrial Congress, representing academia among industry leaders, and currently serves on the editorial boards of high-ranked journals.",
      "Alongside research, Dr Mahwash teaches courses such as pharmaceutical technology, quality control, and aseptic dosage forms, while supervising pharmacy theses and PhD projects. She has also designed and delivered specialised doctoral-level courses, such as nanoparticle engineering, highlighting her commitment to knowledge exchange and innovation in pharmaceutical sciences.",
      "Reflecting on her early journey, she recalled her first role as a retail pharmacist, which clarified her passion for research and development. She credits UOL's academic structure and faculty for shaping her critical thinking, communication, and leadership skills.",
      "Her career has not been without challenges. Moving abroad meant overcoming cultural differences, language barriers, and the isolation of the COVID-19 pandemic. However, these experiences strengthened her resilience and independence. Balancing academic deadlines with personal life has also been demanding, but she manages it with discipline, social engagement, and support from her family.",
      "She continues to look ahead to the future; she aims for a transition from academic research to industrial R&D. Her immediate plans include European certifications in animal handling protocols and advanced training in docking tools to further her expertise in targeted drug delivery.",
      "For UOL students and graduates, she advised, \"Pharmacy is a constantly evolving field, and success lies in lifelong learning, networking, and embracing diverse opportunities.\" She emphasises mastering pharmacotherapy, developing strong problem-solving skills, staying current with emerging technologies, and, above all, cultivating empathy and teamwork in service to the community."
    ]
  }
]

